ERP/src/InformationRegisters/СессииТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СессииТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоСессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Бот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТелеграмИД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТелеграмИД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/СессииТелеграм/Ext/ManagerModule.bsl
Функция ПолучитьТелеграмИД(КонтрагентСсылка, Бот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СессииТелеграм.ТелеграмИД КАК ТелеграмИД
		|ИЗ
		|	РегистрСведений.СессииТелеграм КАК СессииТелеграм
		|ГДЕ
		|	СессииТелеграм.Бот = &Бот
		|	И СессииТелеграм.Контрагент = &КонтрагентСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СессииТелеграм.НачалоСессии";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ТелеграмИД;
		
КонецФункции
